<template>
  <div class="card">
    <div class="card-title">隱私權條款</div>
    <pre class="privacy-text">
      • 本網站重視您在網路上的隱私權。為了讓您瞭解當您造訪本網站時，所享有關於個人資料（個人資料是指得以識別您的身分且未公開的資料，如姓名、地址、電子郵件地址或電話號碼）保護的權利，我們將逐項說明如下，請您詳細閱讀下列條款。如您開始使用本服務視為您已接受本隱私政策。若有任何意見或疑問，歡迎您與我們聯絡。
      • 隱私權保護政策內容，包括本網站如何處理在您使用網站服務時收集到的個人識別資料。隱私權保護政策不適用於本網站以外的相關連結網站，也不適用於非本網站所委託或參與管理的人員。

      一、個人資料的蒐集、處理及利用方式
      1. 本網站為了更準確的提供您服務，因而需要請您在下列情況下提供個人相關資料：
         • 當您使用本網站服務或參與本網站活動時，我們將視服務或活動性質請您提供必要的個人資料，且原則上於蒐集個人資料之特定目的必要範圍內處理或利用您的個人資料。
         • 本網站在您使用意見回饋、電子報、問卷調查等互動性功能時，會保留您所提供的姓名、電子郵件地址、聯絡方式及使用時間等。
         • 於一般瀏覽時，伺服器會自行記錄相關行徑，包括您使用連線設備的 IP 位址、使用時間、使用的瀏覽器、瀏覽及點選資料記錄等，做為我們增進網站服務的參考依據，此記錄為內部應用，絕不對外公佈。
         • 為提供精確的服務，我們會將收集的問卷調查內容進行統計與分析，分析結果之統計數據或說明文字呈現，除供內部研究外，我們會視需要公佈統計數據及說明文字，但不涉及特定個人之資料。
         • 我們所收集的個人資料，主要用途是使我們得以更準確的提供產品或服務給客戶、滿足客戶的需求、或通知客戶有關本網站最新的產品與服務。

      2. 我們亦可能為內部目的使用個人資料，例如：稽核、資料分析及研究等，以改進我們的產品、服務、網頁呈現方式、及與客戶的溝通管道。
         • 本網站在未經您同意前，絕不會將您所登錄的個人資訊揭露、租借或轉售給第三者，或是將您的資料使用於未事先告知您的其他用途。

      二、關於您個人資料的修改與刪除
      1. 當您在本網站註冊成為會員後，您可以隨時利用您的ID和密碼更改或刪除您原先提供的資料，以確保其正確性。
      2. 與第三人共用個人資料之政策：本網站絕不會提供、交換、出租或出售任何您的個人資料給其他個人、團體、私人企業或公務機關，但有法律依據或合約義務者，不在此限。
         • 前項但書之情形包括不限於：配合司法單位之調查、經由您書面同意、法律明文規定、內部分析與研究用途。

      三、利用個人資料之期間、地區、對象及方式
      1. 期間：個人資料蒐集之特定目的存續期間、依相關法令或契約約定之保存年限或本公司因執行業務所必需之保存期間。(以上期間以最長者為準)
      2. 地區：本公司、本公司關係企業、有業務往來機構及有合作關係之第三人之營業處所所在地。
      3. 對象：本公司、本公司關係企業、未受主管機關限制之國際傳輸個人資料之接收者、業務委外機構以及具有合作關係之第三人、依法有權之機關或機構。如果本服務全部或部分業務被其他公司收購或合併，本公司會將您的個人資料轉移給該公司。

      四、帳號及個人資料隱私保護
      • 為保障您的隱私及安全，您的帳號資料會用密碼保護。

      五、網站對外的相關連結
      • 您可透過本網站所提供的連結，點選進入其他網站，但這些連結網站的隱私權政策與本網站之隱私權政策可能不同，本隱私權政策除本網站及本服務、線上客服系統外，並不適用於其他連結網站，建議您自行參考並仔細閱讀該連結網站中的隱私權政策。

      六、關於COOKIE的使用
      • 本網站有可能在您的電腦設定並取用本網站COOKIES，以提供貼心便利的各項服務。COOKIES是網站伺服器用來和使用者瀏覽器進行溝通的一種技術，它可能在使用者的電腦中儲存某些資訊，但是使用者可以藉由瀏覽器的設定，取消或限制此項功能，此項功能的取消將會造成您不能正常使用本網站的部分主要功能。

      七、當事人權益
      • 我們尊重您提供的個人資料。關於您所提供予我們的個人資料，您可以透過聯繫本公司客戶服務 (Email:reservation.service@dunqian.com) 行使下列權利：依照個資法之規定查詢或請求閱覽、請求製給複製本、請求補充或更正、請求停止蒐集、處理或利用、請求刪除。惟本公司有權就衍生之費用酌收手續費。

      八、隱私權條款的修改
      • 由於科技發展的迅速，相關法規訂定未臻完備，以及未來可能難以預見的環境變遷等因素，本網站將會視需要修改我們在網站上所提供的隱私權說明，以落實保障您隱私權之立意。當我們完成隱私權條款修改時，我們會立即將其刊登於本網站的網站中，不會另外個別通知使用者，建議您隨時注意並確認本網站之條款，以維護您瀏覽本網站之安全及相關權益；如不同意本公司之修正或更新，請即時向本公司終止服務，惟若繼續使用本網站及本服務，則視同已接受條款之修正及更新。如您對上述內容或本網站有任何不明瞭之處或意見，請立即與服務人員聯繫 (Email:reservation.service@dunqian.com)
    </pre>
    <Button buttonClass="btn primary-btn" @click="$emit('close')">關閉</Button>
  </div>
</template>
<script setup lang="ts">
import Button from '@/components/Button.vue'
</script>
<style lang="scss" scoped>
@mixin flex-center {
  display: flex;
  justify-content: center;
  align-items: center;
}

@mixin text-style($weight, $size, $color) {
  font-weight: $weight;
  font-size: $size;
  color: $color;
  line-height: 140%;
  text-align: center;
  letter-spacing: 1.92px;
}

.btn {
  width: 100%;
}

.card {
  width: 1113px;
  @include flex-center;
  flex-direction: column;
  gap: 30px;
  overflow: auto;

  &-title {
    @include text-style(400, 24px, var(--Primary));
  }
}

.privacy-text {
  max-width: 100%;
  white-space: pre-wrap;
  word-wrap: break-word;
  line-height: 1.6;
}
</style>
